//=============================================================================
//
// Author : TakeuchiHiroto
//
//=============================================================================
#pragma once

//*****************************************************************************
// マクロ定義
//*****************************************************************************
enum COLLISION_TYPE
{
	TYPE_BB,
	TYPE_BC,
};

enum COLLISION_LAYER 
{
	LAYER_PLAYER,		// プレイヤーの体
	LAYER_PLAYER_ATK,	// プレイヤーの攻撃
	LAYER_ENEMY,		// エネミーの体
	LAYER_ENEMY_ATK,	// エネミーの攻撃
	LAYER_OBSTACLE		// マップに配置する障害物
};

//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct COLLISION
{
	bool use;				// 使っているか
	bool ans;				// 当たっているかを保存
	int gameObjectIndex;	// ポジションを参照する
	XMFLOAT3 size;			// サイズを保存
	COLLISION_TYPE type;	// 当たり判定のタイプを保存
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//collisionのセット
int SetCollision(int gameObjectIndex, XMFLOAT3 size, COLLISION_TYPE type);