//=============================================================================
//
// Author : TakeuchiHiroto
//
//=============================================================================
#pragma once


//*****************************************************************************
// マクロ定義
//*****************************************************************************

enum UI
{
	ATK_MAHOUZIN = 0,		// 魔法陣のレティクルてきなやつ
	ICON_MAHOUZIN,		// 右下のアイコン
	BLIND_MAHOUZIN,		// 右下のアイコンを隠す（クールダウン）

	UI_MAX,
};



//*****************************************************************************
// 構造体定義
//*****************************************************************************
struct UI_ELEMENT{
	BOOL use;					// 使用しているか
	XMFLOAT2 pos;				// どこに配置するか
	WHSIZE size;				// サイズ
	XMFLOAT2 t_pos;				// テクスチャの位置
	WHSIZE t_size;				// テクスチャのサイズ
	XMFLOAT4 color;				// 色
	char* TexturName;			// テクスチャのパス
	ID3D11ShaderResourceView* Texture;	// テクスチャ情報
};


//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitUI(void);
void UninitUI(void);
void UpdateUI(void);
void DrawUI(void);

UI_ELEMENT* GetUI(UI index);
